[{"tag":"string","sons":["*********\n*08_Bash*\n*********\n\n***\n*1*\n***\n\n#Comandi da utilizzare:\n#pwd, nano, mkdir, mv, cp, rm, rmdir cd, ls\n#per avere informazioni su un comando:\n#man nomecomando\n\n\n#Visualizza la tua posizione corrente all'interno del file-system.\n\n\n#Crea file contenente le tue considerazioni su Linux e sul terminale.\n\n\n#Crea una directory verifiche nella tua home.\n\n\n#Crea una directory esercizi nella tua home\n\n\n#Crea una directory spazzatura nella directory esercizi.\n\n\n#Sposta il file creato nella directory esercizi rinominandolo come 1.txt .\n\n\n#Copia nella tua home il file /home/ferri-emanuele/public_html/bash/0.txt e e poi cancellalo.\n\n\n#Cancella la directory spazzatura.\n\n\n#Gironzola liberamente all'interno del file-system e ritorna nella tua home il più in fretta possibile.\n\n\n\n\n***\n*2*\n***\n\n#Comandi da utilizzare:\n#mkdir, cp, mv, cat, touch, ls, ln, rm\n#per informazioni su un comando:\n#man nomeComando\n\n\n#creare una directory pippo nella propria home e al suo interno creare un'altra directory pluto\n\n\n#accedere alla directory pluto mediante il collegamento\n\n\n#dalla home cancellare la directory pippo e il suo contenuto con un solo comando\n\n\n#riprovare ad accedere alla directory pluto mediante il suo collegamento\n\n\n#cancellare il collegamento ormai inutile\n\n\n#spostarsi nella directory più interna (pluto) e copiarci dentro il file /home/ferri-emanuele/public_html/bash/1.txt\n\n\n#spostare il file 1.txt nella directory superiore (pippo) usando un percorso relativo\n\n\n#visualizzare il file 1.txt (senza usare nano)\n\n\n#nascondere il file 1.txt mettendo un punto (.) all'inizio del file\n\n\n#creare un file vuoto prova.txt (senza usare nano)\n\n\n#visualizzare gli attributi di tutti i file e le directory contenuti nella directory pippo\n\n\n#visualizzare gli attributi di tutti i file con estensione txt contenuti nella directory pippo\n\n\n#nella propria home creare un collegamento alla directory pluto (la più interna)\n\n\n\n\n***\n*3*\n***\n\n#Comandi da usare:\n#mkdir, cd, touch, chmod, ls\n\n\n#Creare una directory vuota prova.\n\n\n#Creare all'interno della directory prova il file vuoto 1.txt.\n\n\n#Cambiare i permessi del file in modo da aggiungere e togliere la leggibilità, scrivibilità ed eseguibilità al proprietario, al gruppo, a tutti gli altri.\n\n\n#Verificare ogni modifica dei permessi effettuata sul file.\n\n\n\n\n***\n*4*\n***\n\n#Comandi da usare: reindirizzamento dell'output >, sort, cat, cut\n\n\n#salva in un file l'elenco di tutte le home degli utenti\n\n\n#scrivi una poesia nel file poesia.txt nella tua home\n\n\n#ordina le righe della poesia\n\n\n#crea un poema ordinando la concatenazione di tutte le poesie presenti\n\n\n#salva il poema in un file\n\n\n#visualizza gli utenti del sistema e salva l'output in un file\n\n\n\n\n***\n*5*\n***\n\n\n\n#Crea una directory spazzatura e la directory spazzaneve nella tua home.\n\n\n#Copia il file /home/ferri-emanuele/public_html/conversioni.txt nella directory spazzatura col nome conv.txt .\n\n\n#Sposta il file da spazzatura a spazzaneve rinominandolo col nome boh.txt .\n\n\n#Visualizza il contenuto del file senza usare un editor.\n\n\n#Cancella il file.\n\n\n\n\n***\n*6*\n***\n\n#Crea nella tua home la directory \"pizza\" e spostati al suo interno.\n\n\n#Crea i file vuoti \"pippo\" e \"pluto\" possibilmente senza usare un editor.\n\n\n#Crea la directory \"topolinia\".\n\n\n#Sposta il file \"pippo\" nella directory \"topolinia\". Sposta anche il file \"pluto\" nella directory \"topolinia\" cambiandogli il nome in \"topolino\".\n\n\n#Copia i due file, \"pippo\" e \"topolino\", nella directory superiore.\n\n\n#Cancella i file \"pippo\", \"topolino\" e la directory \"topolinia\".\n\n\n#Rendi eseguibile a tutti il file \"pippo\" e togli il permesso di lettura e scrittura al proprietario del file \"topolino\".\n\n\n#Elenca i file della directory \"pizza\" coi relativi attributi (permessi, data, proprietario, gruppo, ...) e salva l'output nel file \"elenco\". Controlla il contenuto del file \"elenco\" per verificare che i permessi siano giusti.\n\n\n#Crea un link simbolico alla directory \"/etc\" .\n\n\n\n\n***\n*7*\n***\n\n#Crea la directory film e spostati al suo interno.\n\n\n#Crea la directory fantascienza.\n#Possibilmente senza spostarti, nella directory fantascienza, SENZA USARE UN EDITOR, crea il file matrix e il file interstellar.\n\n\n#Entra nella directory fantascienza.\n#Nascondi il file interstellar e visualizza il contenuto della directory corrente (fantascienza), compresi i file nascosti.\n\n\n#Cancella il file nascosto e sposta il file matrix nella directory superiore.\n\n\n#Spostati nella directory superiore (film).\n#Mostra il contenuto della directory corrente (film), compresi i permessi, reindirizzando l'output nel file elenco.txt della directory film.\n\n\n#Visualizza il contenuto del file elenco.txt, possibilmente ordinando le righe.\n\n\n#Cambia i permessi del file matrix in modo da renderlo scrivibile a tutti e togli l'accesso in lettura al gruppo alla directory fantascienza.\n\n\n#Nella directory film, crea un link simbolico alla directory corrente, ossia film ( :-| :-/ :-O ) ed entra nel link un paio di volte...\n\n\n#Cancella la directory fantascienza e tutti i file con estensione .txt .\n\n\n\n\n***\n*8*\n***\n\n#Crea la directory videogiochi e spostati al suo interno.\n\n\n\n\n#Crea i file ps4 e xboxone nella directory sony e il file xbox360 nella directory microsoft.\n\n\n#Sposta il file xboxone dalla directory sony alla directory microsoft e nascondi il file xbox360.\n\n\n#Cancella il file ps4 della directory sony e la directory sony.\n\n\n#Elenca i file della directory microsoft COMPRESI QUELLI NASCOSTI e reindirizza l'output nel file microsoft.txt .\n\n\n#Aggiungi il permesso di scrittura per il gruppo al file microsoft.txt e togli il permesso di accesso per gli altri alla directory microsoft.\n\n\n#Crea un link simbolico alla directory /usr/local/bin .\n\n\n#Visualizza il file /etc/passwd senza usare un editor.\n\n"]}]